

/* 변수 이름 규칙
    숫자로 시작하면 안된다.
    특수문자는 언더스코어(_)와 달러($)만 허용된다.
    공백은 허용되지 않는다.
    대소문자가 구분된다.
    자바스크립트의 예약어는 사용할 수 없다. 
    한글사용가능하나 권장되지 않는다.
    */


    /* 명명 기법
    카멜표기법(camel notation) : 첫 단어는 소문자, 두번째 단어부터는 첫글자를 대문자로 표기
    파스칼표기법(Pascal notation) : 모든 단어의 첫글자를 대문자로 표기
    스네이크표기법(snake notation) : 모든 단어를 소문자로 표기하고 단어사이는 언더스코어(_)로 연결
    헝가리언표기법(Hungarian notation) : 변수의 타입이나 용도를 접두사로 붙임

    단어 여러개를 합쳐서 식별자를 만들때 사용하는 기법
    my, name, is, kim 를 합쳐서 만든다면
    카멜표기법 : myNameIsKim
    파스칼표기법 : MyNameIsKim
    스네이크표기법 : my_name_is_kim
    헝가리언표기법 : strNameIsKim (문자열이라는 뜻의 str 접두사 사용)
    */